# CurveLoop Properties

---
The CurveLoop type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
CurveLoop Class
Autodesk.Revit.DB Namespace